import React, { Component } from 'react';

import '../css/Concept.css';

export default class Concept extends Component {
  render () {
    return (
      <div className="Concept">
        <header>
          <h2>会社概要</h2>
        </header>
        <article>
          <p>新しい時代の覇権を選ばれた国民が得るは、歴史の必然である。<br />
            ならば、我らは襟を正し、この戦局を打開しなければならぬ。<br />
            我々は過酷な宇宙空間を生活の場としながらも共に苦悩し、<br />
            錬磨して今日の文化を築き上げてきた。<br />
            かつて、ジオン・ダイクンは人類の革新は宇宙の民たる我々から始まると言った。<br />
            しかしながら地球連邦のモグラ共は、<br />
            自分たちが人類の支配権を有すると増長し我々に抗戦する。<br />
            諸君の父も、子もその連邦の無思慮な抵抗の前に死んでいったのだ！<br />
            この悲しみも怒りも忘れてはならない！<br />
            それを、ガルマは！死をもって我々に示してくれた！<br />
            我々は今、この怒りを結集し、連邦軍に叩きつけて、初めて真の勝利を得ることができる。<br />
            この勝利こそ、戦死者全てへの最大の慰めとなる。<br />
            国民よ立て！悲しみを怒りに変えて、立てよ！国民よ！<br />
            我らジオン国国民こそ選ばれた民であることを忘れないでほしいのだ。<br />
            優良種である我らこそ人類を救い得るのである。ジーク・ジオン!
          </p>
        </article>
      </div>
    )
  }
};


